app/controllers/friends_controller.rb

  def create
    #@friend = Friend.new(friend_params)
    @friend = current_user.friends.build(friend_params)

    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "twitter", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    respond_to do |format|
      if @friend.update(friend_params)
---
UPDATE "friends" SET "first_name" = ?, "updated_at" = ?, "user_id" = ? WHERE "friends"."id" = ?  [["first_name", "NS_updated"], ["updated_at", "2023-12-12 06:10:24.951288"], ["user_id", 6], ["id", 51]]

def destroy
  @friend.destroy!
---
DELETE FROM "friends" WHERE "friends"."id" = ?  [["id", 57]]